In [1]:
import sqlalchemy

%load_ext sql
%sql oracle://scott:tiger@localhost:1521/orcl

# where 절
"Where 절을 사용하면 특정 조건에 대한 데이터만 선별해서 출력할 수 있다.
## 숫자 데이터 검색

In [7]:
%%sql
select ename, sal
from emp
where sal > 3000

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', Decimal('5000'))]

문제 16. 사원번호가 7788 번인 사원의 사원번호와 이름과 월급을 출력하시요

In [8]:
%%sql

select ename, sal
    from emp
    where empno = 7788

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SCOTT', Decimal('3000'))]

문제 17. 30번 부서번호에서 근무하는 사원들의 이름과 월급과 부서번호를 출력하시오

In [9]:
%%sql

select ename, sal, deptno
    from emp
    where deptno=30

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('BLAKE', Decimal('2850'), 30),
 ('MARTIN', Decimal('1250'), 30),
 ('ALLEN', Decimal('1600'), 30),
 ('TURNER', Decimal('1500'), 30),
 ('JAMES', Decimal('950'), 30),
 ('WARD', Decimal('1250'), 30)]

문제 18. 위 결과를 다시 출력하는데 월급이 높은 사원부터 출력하시오

In [10]:
%%sql

select ename, sal, deptno
    from emp
    where deptno=30
    order by sal desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('BLAKE', Decimal('2850'), 30),
 ('ALLEN', Decimal('1600'), 30),
 ('TURNER', Decimal('1500'), 30),
 ('WARD', Decimal('1250'), 30),
 ('MARTIN', Decimal('1250'), 30),
 ('JAMES', Decimal('950'), 30)]

※ order by 절은 맨 마지막에 작성  
   &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 순서: select -> from -> where -> order by

문제 19. 부서번호가 20번인 사원들의 이름과 입사일과 부서번호를 출력하는데 최근에 입사한 사원부터 출력하시오

In [11]:
%%sql

select ename, hiredate, deptno
    from emp
    where deptno = 20
    order by hiredate desc

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('ADAMS', datetime.datetime(1983, 1, 15, 0, 0), 20),
 ('SCOTT', datetime.datetime(1982, 12, 22, 0, 0), 20),
 ('FORD', datetime.datetime(1981, 12, 11, 0, 0), 20),
 ('JONES', datetime.datetime(1981, 4, 1, 0, 0), 20),
 ('SMITH', datetime.datetime(1980, 12, 9, 0, 0), 20)]

## 문자와 날짜 검색
"Where절로 데이터를 검색할 때 숫자와는 다르게 문자와 날짜는 싱글 퀘테이션 마크를 둘러야 합니다"

In [12]:
%%sql

select ename, sal
    from emp
    where ename='SCOTT'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('SCOTT', Decimal('3000'))]

※ SQL은 대소문자를 구분하지 않으나 데이터는 대소문자를 구분함  
※ 싱글 쿼테이션 마크안에 있는 데이터는 문자 또는 날짜 라는 것을 의미  
※ 날짜 검색을 할때는 년도/월/일 순으로 검색을 하면 되는데 나라마다 순서가 다를 수 있다.  
   미국이나 영국에서의 날짜 검색은 일/월/년도 순서입니다.

문제 20. 직업이 SALESMAN인 사원들의 이름과 월급과 직업을 출력하시오

In [13]:
%%sql

select ename, sal, job
    from emp
    where job = 'SALESMAN'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('MARTIN', Decimal('1250'), 'SALESMAN'),
 ('ALLEN', Decimal('1600'), 'SALESMAN'),
 ('TURNER', Decimal('1500'), 'SALESMAN'),
 ('WARD', Decimal('1250'), 'SALESMAN')]

문제 21. 81년 11월 17일에 입사한 사원의 이름과 입사일을 출력하시오

In [14]:
%%sql

select ename, hiredate
    from emp
    where hiredate = '1981-11-17'

 * oracle://scott:***@localhost:1521/orcl
0 rows affected.

[('KING', datetime.datetime(1981, 11, 17, 0, 0))]